In [1]:
import pandas as pd
import numpy as np

In [2]:
obj1=pd.Series([3,4,5,6])

In [3]:
obj1

0    3
1    4
2    5
3    6
dtype: int64

In [4]:
obj1.values

array([3, 4, 5, 6], dtype=int64)

In [5]:
obj1.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj1_id=pd.Series([3,4,5,7],index=['a','d','c','b'])

In [7]:
obj1_id

a    3
d    4
c    5
b    7
dtype: int64

In [8]:
obj1_id.index

Index(['a', 'd', 'c', 'b'], dtype='object')

In [9]:
obj1_id[['d','c']]

d    4
c    5
dtype: int64

In [10]:
obj1_id['c']=10

In [11]:
obj1_id

a     3
d     4
c    10
b     7
dtype: int64

In [12]:
obj1[obj1>3]

1    4
2    5
3    6
dtype: int64

In [13]:
obj1*3

0     9
1    12
2    15
3    18
dtype: int64

In [14]:
obj1

0    3
1    4
2    5
3    6
dtype: int64

In [15]:
np.exp(obj1)

0     20.085537
1     54.598150
2    148.413159
3    403.428793
dtype: float64

In [16]:
4 in obj1_id

False

In [17]:
obj1_ch=pd.Series(['a','b','c','d'])

In [18]:
obj1_ch

0    a
1    b
2    c
3    d
dtype: object

In [19]:
 'b' in obj1_ch

False

In [20]:
'h' in obj1_ch

False

In [21]:
Se_dic={'kun':132001,'snp':131001, 'pnp':131101,'kuk': 133001}

In [22]:
obj_se_dict=pd.Series(Se_dic)

In [23]:
obj_se_dict.values

array([132001, 131001, 131101, 133001], dtype=int64)

In [24]:
obj_se_dict.index

Index(['kun', 'snp', 'pnp', 'kuk'], dtype='object')

In [25]:
pd.notnull(obj1)

0    True
1    True
2    True
3    True
dtype: bool

In [26]:
obj1_id

a     3
d     4
c    10
b     7
dtype: int64

In [27]:
obj2_id=pd.Series([5,7,3,1],index=['a','b','c','d'])

In [28]:
obj2_id

a    5
b    7
c    3
d    1
dtype: int64

In [29]:
obj1_id+obj2_id

a     8
b    14
c    13
d     5
dtype: int64

In [30]:
obj2_id.index=['one','two','three','four']

In [31]:
obj2_id

one      5
two      7
three    3
four     1
dtype: int64

In [32]:
data={'State':['Delhi', 'Haryana', 'Kerala','Assam','Gujrat'],
      'year':[2015,2016,2017,2018,2019],
      'pop':[3.4,4.1,5.5,3.9,3.7]}

In [33]:
DF1=pd.DataFrame(data)

In [34]:
DF1

     State  year  pop
0    Delhi  2015  3.4
1  Haryana  2016  4.1
2   Kerala  2017  5.5
3    Assam  2018  3.9
4   Gujrat  2019  3.7

In [35]:
pd.DataFrame(data,columns=['year','State','pop','newcol'])

   year    State  pop newcol
0  2015    Delhi  3.4    NaN
1  2016  Haryana  4.1    NaN
2  2017   Kerala  5.5    NaN
3  2018    Assam  3.9    NaN
4  2019   Gujrat  3.7    NaN

In [36]:
DF2=pd.DataFrame(data,columns=['year','State','pop','newcol'],index=['one','two','three','four','five'])

In [37]:
DF2

       year    State  pop newcol
one    2015    Delhi  3.4    NaN
two    2016  Haryana  4.1    NaN
three  2017   Kerala  5.5    NaN
four   2018    Assam  3.9    NaN
five   2019   Gujrat  3.7    NaN

In [38]:
DF1.columns

Index(['State', 'year', 'pop'], dtype='object')

In [39]:
DF2['pop']

one      3.4
two      4.1
three    5.5
four     3.9
five     3.7
Name: pop, dtype: float64

In [40]:
DF1.State

0      Delhi
1    Haryana
2     Kerala
3      Assam
4     Gujrat
Name: State, dtype: object

In [41]:
DF2[:3]

       year    State  pop newcol
one    2015    Delhi  3.4    NaN
two    2016  Haryana  4.1    NaN
three  2017   Kerala  5.5    NaN

In [42]:
DF2.newcol=np.arange(5.)

In [43]:
DF2

       year    State  pop  newcol
one    2015    Delhi  3.4     0.0
two    2016  Haryana  4.1     1.0
three  2017   Kerala  5.5     2.0
four   2018    Assam  3.9     3.0
five   2019   Gujrat  3.7     4.0

In [44]:
DF2['newcol2']=np.arange(5.)

In [45]:
DF2

       year    State  pop  newcol  newcol2
one    2015    Delhi  3.4     0.0      0.0
two    2016  Haryana  4.1     1.0      1.0
three  2017   Kerala  5.5     2.0      2.0
four   2018    Assam  3.9     3.0      3.0
five   2019   Gujrat  3.7     4.0      4.0

In [46]:
DF2.columns

Index(['year', 'State', 'pop', 'newcol', 'newcol2'], dtype='object')

In [47]:
Dic1={'Delhi':{2015:3.5, 2020:4.1}, 'Haryana':{2015: 3.9, 2018:4.1,2020: 4.3 }}

In [48]:
DF3=pd.DataFrame(Dic1)

In [49]:
DF3

      Delhi  Haryana
2015    3.5      3.9
2020    4.1      4.3
2018    NaN      4.1

In [50]:
pd.DataFrame(Dic1,index=[2015,2016,2018,2020])

      Delhi  Haryana
2015    3.5      3.9
2016    NaN      NaN
2018    NaN      4.1
2020    4.1      4.3

In [51]:
DF1.values

array([['Delhi', 2015, 3.4],
       ['Haryana', 2016, 4.1],
       ['Kerala', 2017, 5.5],
       ['Assam', 2018, 3.9],
       ['Gujrat', 2019, 3.7]], dtype=object)

In [52]:
obj1=pd.Series(range(5),index=['a','b','c','d','e'])

In [53]:
index=obj1.index

In [54]:
index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [55]:

index1=['a','b','c','k','e']

In [56]:
obj1.index=index1

In [57]:
obj1

a    0
b    1
c    2
k    3
e    4
dtype: int64